Repository: nuradiyana/debian-handbook
Catalog: */03_existing-setup.po
Languages: de_de, es_es

source: Existing Setup
de_de: Bestehendes Setup
es_es: Instalación existente

source: Reuse
de_de: Wiederverwendung
es_es: Reutilización

source: Migration
es_es: Migración

source: Analyzing the Existing Setup and Migrating
de_de: Untersuchung des bestehenden Setups und Migration
es_es: Analizando la instalación existente y migrando

source: Any computer system overhaul should take the existing system into account. This allows reuse of available resources as much as possible and guarantees interoperability of the various elements comprising the system. This study will introduce a generic framework to follow in any migration of a computing infrastructure to Linux.
de_de: Jedes Computerupdate sollte das bestehende System mit einschließen. Dies erlaubt eine möglichst weitgehende Wiederverwendung von Ressourcen und garantiert das nahtlose Zusammenarbeiten der verschiedenen Elemente, aus denen das System besteht. Diese Studie will ein allgemeingültiges Rahmenkonzept aufzeigen, dem man bei der Migration einer Rechner-infrastruktur hin zu Linux folgen kann.
es_es: Cualquier rediseño de un sistema informático debería tener en cuenta el sistema existente. Esto permite maximizar la reutilización de los recursos disponibles y garantiza la interoperabilidad entre los varios elementos que comprenden al sistema. Este estudio introducirá un marco de trabajo genérico a seguir en cualquier migración de infraestructura informática a Linux.

source: Coexistence in Heterogeneous Environments
de_de: Koexistenz in gemischten Umgebungen
es_es: Coexistencia en entornos heterogéneos

source: <primary>environment</primary><secondary>heterogeneous environment</secondary>
de_de: <primary>Umgebung</primary><secondary>gemischte Umgebung</secondary>
es_es: <primary>entorno</primary><secondary>heterogéneo</secondary>

source: Debian integrates very well in all types of existing environments and plays well with any other operating system. This near-perfect harmony comes from market pressure which demands that software publishers develop programs that follow standards. Compliance with standards allow administrators to switch out programs: clients or servers, whether free or not.
de_de: Debian lässt sich sehr gut in alle Arten von bestehenden Umgebungen einbinden und arbeitet gut mit allen anderen Betriebssystemen zusammen. Diese fast perfekte Harmonie rührt vom Wettbewerb her, der dafür sorgt, dass Softwarehersteller ihre Programme den Standards folgend erstellen. Die Beachtung von Standards erlaubt es den Administratoren, Programme auszutauschen: Clients oder Server, egal ob frei oder nicht.
es_es: Debian se integra perfectamente en todos los tipos de entornos existentes y funciona muy bien con otros sistemas operativos. Esta armonía casi perfecta es fruto de la presión del mercado que demanda que los distribuidores de software desarrollen programas que cumplan estándares. El cumplimiento de los estándares permite a los administradores cambiar programas por otros: clientes o servidores, sean libres o no.

source: Integration with Windows Machines
de_de: Integration mit Windows-Rechnern
es_es: Integración con equipos Windows

source: Samba's SMB/CIFS support ensures excellent communication within a Windows context. It shares files and print queues to Windows clients and includes software that allow a Linux machine to use resources available on Windows servers.
de_de: Samba's SMB-/CIFS-Support bietet eine exzellente Kommunikation innerhalb von Windows-Umgebungen. Es verteilt Dateien und Druckerwarteschlangen an Windows-Clients und enthält Software, die es Linux-Rechnern erlaubt, Ressourcen von Windows-Servern zu nutzen.
es_es: La compatibilidad con SMB/CIFS de Samba garantiza una comunicación excelente en un contexto Windows. Comparte archivos y colas de impresión con clientes Windows e incluye software que le permite a un equipo Linux utilizar recursos disponibles en servidores Windows.

source: <emphasis>TOOL</emphasis> Samba
es_es: <emphasis>HERRAMIENTA</emphasis> Samba

source: Samba version 2 behaves like a Windows NT server (authentication, files, print queues, downloading printer drivers, DFS, etc.) Version 3 works with Active Directory, brings interoperability with NT4 domain controllers, and supports RPCs (Remote Procedure Calls). Version 4 is a rewrite (still experimental), the purpose of which is to provide functionality of a domain controller compatible with Active Directory.
de_de: Samba Version 2 verhält sich wie ein Windows-NT-Server (Authentifizierung, Dateien, Druckerwarteschlangen, Herunterladen von Druckertreibern, DFS usw.). Version 3 arbeitet mit Active Directory, sorgt für die Interoperabilität mit NT4-Domänencontrollern und unterstützt RPC (Remote Procedure Calls). Version 4 wurde komplett neu geschrieben (ist jedoch immer noch experimentell). Ziel ist die Bereitstellung der Funktionalitäten eines Domain Controller, der zum Active Directory kompatibel ist.
es_es: La versión 2 de Samba se comporta como un servidor Windows NT (autenticación, archivos, colas de impresión, descarga de controladores de impresoras, DFS, etc.). La versión 3 trabaja con Active Directory, introduce interoperabilidad con controladores de dominio NT4 y RPCs («Remote Procedure Calls»: llamadas remotas a procedimientos). La versión 4 es una reescritura (aún experimental) cuyo propósito es proveer la funcionalidad de un controlador de dominio compatible con Active Directory.

source: Integration with Mac OS machines
de_de: Vernetzung mit MacOS-Rechnern
es_es: Integración con equipos Mac OS

source: Netatalk is a program which uses the Appletalk protocol (running on a Linux kernel) and allows Debian to interface with a Mac OS network. It ensures the operation of the file server and print queues, as well as time server (clock synchronization). Its router function allows interconnection with Appletalk networks.
de_de: Netatalk, das auf einem Linux-Kernel läuft, ist ein Programm, das das Appletalk-Protokoll nutzt und es Debian ermöglicht, mit einem MacOS-Netzwerk zusammenzuarbeiten. Es erlaubt die Arbeit mit Dateiservern und Druckerwarteschlangen sowie die Nutzung als Zeitserver (Uhrensynchronisierung). Seine Routerfunktionalität erlaubt die Verbindung zu Appletalk-Netzwerken.
es_es: Netatalk es un programa que utiliza el protocolo Appletalk (que ejecuta en un núcleo Linux) y permite que Debian interactúe en una red Mac OS. Asegura el funcionamiento del servidor de archivos y colas de impresión así como también el servidor de tiempo (sincronización de reloj). Sus funciones de enrutamiento permiten la interconexión con redes Appletalk.

source: Integration with Other Linux/Unix Machines
de_de: Vernetzung mit anderen Linux/Unix-Rechnern
es_es: Integración con otros equipos Linux/Unix

source: Finally, NFS and NIS, both included, guarantee interaction with Unix systems. NFS ensures file server functionality, while NIS creates user directories. The BSD printing layer, used by most Unix systems, also allows sharing of print queues.
de_de: Schließlich sorgt die integrierte Unterstützung von NFS und NIS für eine reibungslose Zusammenarbeit mit Unix-Systemen. NFS stellt die Fileserverfunktionalität zur Verfügung, während NIS Benutzerverzeichnisse anlegt. Das von den meisten Unix-Systemen genutzte BSD-Printing-Layer erlaubt auch die Verteilung von Druckerwarteschlangen.
es_es: Finalmente, NFS y NIS, ambos incluidos, garantizan la iteracción con sistemas Unix. NFS proporciona la funcionalidad de servidor de archivos mientras que NIS crea los directorios de usuario. La capa de impresión de BSD, utilizada ampliamente por los sistemas Unix, también permite compartir colas de impresión.

source: Coexistence of Debian with MacOS, Windows and Unix systems
de_de: Koexistenz von Debian mit MacOS-, Windows- und Unix-Systemen
es_es: Coexistencia de Debian con sistemas MacOS, Windows y Unix

source: How To Migrate
de_de: Migrationsvorgang
es_es: Cómo migrar

source: <primary>migration</primary>
es_es: <primary>migración</primary>

source: In order to guarantee continuity of the services, each computer migration must be planned and executed according to the plan. Whatever the operating system used, this principle never changes.
de_de: Um die Aufrechterhaltung des Betriebs zu gewährleisten, muss jede Migration geplant und anhand dieses Plans durchgeführt werden. Dieses Prinzip ändert sich nie, egal welches Betriebssystem benutzt wird.
es_es: Para poder garantizar la continuidad de los servicios, la migración de cada equipo debe ser planificada y realizada de acuerdo al plan. Este principio nunca cambia sin importar el sistema operativo que utilice.

source: Survey and Identify Services
de_de: Überprüfen und Identifizieren der Dienste
es_es: Reconocimiento e identificación de servicios

source: As simple as it seems, this step is essential. A serious administrator truly knows the principal roles of each server, but such roles can change, and sometimes experienced users may have installed “wild” services. Knowing that they exist will at least allow you to decide what to do with them, rather than delete them haphazardly.
de_de: So einfach es auch scheint, dieser Schritt ist entscheidend. Ein professioneller Administrator kennt die primären Aufgaben jedes Servers genau. Solche Aufgaben können sich jedoch ändern, und manchmal haben erfahrene Nutzer vielleicht auch "wilde" Dienste installiert. Wenn man wenigstens über sie Bescheid weiß, kann man zumindest entscheiden, was man mit ihnen machen wird, anstatt sie planlos zu löschen.
es_es: Simple como parece, este paso es esencial. Un administrador serio realmente conoce los roles principales de cada servidor, pero dichos roles pueden cambiar y a veces usuarios experimentados pueden haber instalado servicios «salvajes». Saber que existen le permitirá, al menos, decidir qué hacer con ellos en lugar de eliminarlos sin orden ni propósito.

source: For this purpose, it is wise to inform your users of the project before migrating the server. To involve them in the project, it may be useful to install the most common free software programs on their desktops prior to migration, which they will come across again after the migration to Debian; OpenOffice.org and the Mozilla suite are the best examples here.
de_de: Zu diesem Zweck ist es sinnvoll, Ihre Benutzer vor der Servermigration über das Projekt zu informieren. Um sie an dem Projekt zu beteiligen, könnte es nützlich sein, vor der Migration die am häufigsten verwendete freie Software auf denjenigen Desktops zu installieren, mit denen die Benutzer nach der Migration zu Debian später wieder arbeiten; OpenOffice.org und die Mozilla-Suite sind dafür die besten Beispiele.
es_es: Por ello, es buena idea informar a sus usuarios del proyecto antes de migrar el servidor. Involucrarlos en el proyecto puede ser útil para instalar el software libre más común en sus equipos de escritorio antes de la migración, programas con los que se encontrarán luego de la migración a Debian; OpenOffice.org y la suite Mozilla son los mejores ejemplos de tales programas.

source: Network and Processes
de_de: Netzwerk und Prozesse
es_es: La red y los procesos

source: <indexterm><primary><command>nmap</command></primary></indexterm> The <command>nmap</command> tool (in the package with the same name) will quickly identify Internet services hosted by a network connected machine without even requiring to log in to it. Simply call the following command on another machine connected to the same network:
de_de: <indexterm><primary>Das <command>nmap</command> Werkzeug </primary></indexterm> (im gleichnamigen Paket) identifiziert schnell Internetdienste, die auf einer Maschine laufen und die über das Netzwerk verbunden sind, ohne dass ein Login benötigt wird. Man braucht nur das folgende Kommando auf einem anderen Rechner aufzurufen, der mit demselben Netzwerk verbunden ist:
es_es: <indexterm><primary><command>nmap</command></primary></indexterm> La herramienta <command>nmap</command> (en el paquete del mismo nombre) identificará rápidamente servicios de internet hospedados en un equipo conectado a la red sin siquiera necesitar iniciar sesión en el mismo. Simplemente ejecute la siguiente orden en otro equipo conectado a la misma red:

source: <emphasis>ALTERNATIVE</emphasis> Use <command>netstat</command> to find the list of available services
de_de: <emphasis>ALTERNATIVE</emphasis> Benutze <command>netstat</command>, um die verfügbaren Dienste anzuzeigen
es_es: <emphasis>ALTERNATIVA</emphasis> Utilice <command>netstat</command> para encontrar la lista de servicios disponibles

source: On a Linux machine, the <command>netstat -tupan</command> command will show the list of active or pending TCP sessions, as well UDP ports on which running programs are listening. This facilitates identification of services offered on the network.
de_de: Auf einem Linux-Rechner kann mit dem Befehl <command>netstat -tupan</command> eine Liste von aktiven und anstehenden TCP-Sitzungen sowie von UDP-Ports, an denen laufende Programme horchen, angezeigt werden. Dies erleichtert das Aufspüren von Diensten, die im Netzwerk angeboten werden.
es_es: En los equipos Linux, la orden <command>netstat -tupan</command> mostrará la lista de sesiones TCP activas o pendientes así como también los puertos UDP en los que escuchan los programas. Esto facilita la identificación de los servicios que se ofrecen en la red.

source: <emphasis>GOING FURTHER</emphasis> IPv6
de_de: <emphasis>Vertiefung / Weiterführende Informationen</emphasis> IPv6
es_es: <emphasis>YENDO MÁS ALLÁ</emphasis> IPv6

source: Some network commands may work either with IPv4 (the default usually) or with IPv6. This is especially the case with the <command>nmap</command> and <command>netstat</command> commands, but also others, such as <command>route</command> or <command>ip</command>. The convention is that this behavior is enabled by the <parameter>-6</parameter> command-line option.
de_de: Einige Netzwerkbefehle arbeiten entweder mit IPv4 (was normalerweise der Standard ist) oder mit IPv6. Das ist speziell bei <command>nmap</command> und <command>netstat</command> so, aber auch bei anderen wie etwa <command>route</command> oder <command>ip</command> der Fall. Konvention ist, dass dieses Verhalten mit der Kommandozeilenoption <parameter>-6</parameter> eingeschaltet wird.
es_es: Algunas órdenes de red pueden ser utilizados con IPv4 (lo predeterminado normalmente) o con IPv6. Este es el caso especialmente de las órdenes <command>nmap</command> y <command>netstat</command>, pero también hay otros como <command>route</command> o <command>ip</command>. La convención es que la opción <parameter>-6</parameter> activa este comportamiento.

source: If the server is a Unix machine offering shell accounts to users, it is interesting to determine if processes are executed in the background in the absence of their owner. The command <command>ps auxw</command> displays a list of all processes with their user identity. By checking this information against the output of the <command>who</command> command, which gives a list of logged in users, it is possible to identify wild servers or programs running in the background. Looking at <filename>crontabs</filename> (tables listing automatic actions scheduled by users) will often provide interesting information on functions fulfilled by the server (a complete explanation of <command>cron</command> is available in <xref linkend="sect.task-scheduling-cron-atd" />).
de_de: Wenn auf einem Server Unix läuft und Anwendern eine Shell angeboten wird, ist es oftmals interessant, zu wissen, ob ein Prozess auch in Abwesenheit des Users im Hintergrund läuft. Das Dienstprogramm <command>ps auxw</command> zeigt alle laufende Prozesse mit der zugehörigen ID. Ein Gegenprüfen dieser Informationen mit der Ausgabe des <command>who</command>-Befehls, das eine Liste der angemeldeten User zeigt, kann helfen, verwaiste Prozesse aufzeigen.n Ein Blick auf <filename>crontab</filename> zeigt oftmals interessante Information über Funktionen und Prozesse, die der Server regelmäßig ausführt. Eine vollständige Erläuterung des <command>cron</command>-Befehls findet sich hier <xref linkend="sect.task-scheduling-cron-atd" />
es_es: Si el servidor es un equipo Unix ofreciendo acceso de consola a los usuarios, es interesante determinarlo si se ejecutan procesos en segundo plano en ausencia de su usuario. La orden <command>ps auxw</command> muestra una lista de todos los procesos con la identidad de su usuario. Comparar esta información con la salida de la orden <command>who</command>, que provee la lista de usuarios con sesiones activas, permite identificar servidores salvajes o programas ejecutando en segundo plano. Revisar <filename>crontab</filename> (tablas de acciones programadas por usuarios) generalmente proveerá información interesante sobre las funciones que cumple el servidor (una explicación completa de <command>cron</command> está disponible en la <xref linkend="sect.task-scheduling-cron-atd" />).

source: In any case, it is essential to backup your servers: this allows recovery of information after the fact, when users will report specific problems due to the migration.
de_de: In jedem Fall ist es absolut unerlässlich, Sicherheitskopien des eigenen Servers anzulegen. Dadurch ist es möglich, Informationen wiederherzustellen, falls Benutzer Probleme aufgrund der Migration melden.
es_es: En cualquier caso, es esencial que haga respaldos de sus servidores: de esta forma se asegurará que la información pueda ser recuperada después del hecho, cuando los usuarios informen acerca de problemas concretos derivados de la migración.

source: Backing up the Configuration
de_de: Sichern der Konfiguration
es_es: Respaldos de la configuración

source: It is wise to retain the configuration of every service identified in order to be able to install the equivalent on the updated server. The strict minimum is to print the configuration files and make a backup copy of them.
de_de: Es wird empfohlen, die Konfiguration jedes verwendeten Dienstes zu sichern, um dessen Äquivalent auf dem aktualisierten Server einzurichten. Die Konfiguration der Dienste sollte mindestens ausgedruckt werden sowie als digitale Kopie vorliegen.
es_es: Es buena idea conservar la configuración de todo servicio identificado para poder instalar el equivalente en el nuevo servidor. Como mínimo, imprimir los archivos de configuración y hacer respaldos de los mismos.

source: For Unix machines, the configuration files are usually found in <filename>/etc/</filename>, but they may be located in a sub-directory of <filename>/usr/local/</filename>. This is the case if a program has been installed from sources, rather than with a package. One may also find them, in some cases, under <filename>/opt/</filename>.
de_de: Für Unix-Maschinen befinden sich die Konfigurationsdateien gewöhnlich in <filename>/etc/</filename>. Sie können sich aber auch in einem Unterverzeichnis von <filename>/usr/local/</filename> befinden. Dies ist der Fall, wenn ein Programm durch Kompilieren des Quellcodes installiert wird. In manchen Fällen sind die Dateien auch unter <filename>/opt/</filename> zu finden.
es_es: En los equipos Unix, los archivos de configuración se encuentran normalmente en <filename>/etc/</filename> pero puede que se encuentren en un subdirectorio de <filename>/usr/local/</filename>. Este es el caso si el programa se ha instalado desde las fuentes en lugar de utilizar un paquete. Incluso puede que se encuentren en algunos casos en <filename>/opt/</filename>.

source: For data managing services (such as databases), it is strongly recommended to export them to a standard format that will be easily imported by the new software. Such a format is usually in text mode and documented; it may be, for example, an SQL dump for a database, or an LDIF file for an LDAP server.
de_de: Bei Diensten zur Datenverwaltung (wie zum Beispiel Datenbanken) wird dringend empfohlen, die Daten in ein standardisiertes Format zu exportieren, das durch die neue Software problemlos wieder importiert werden kann. Ein solches Format ist üblicherweise dokumentiert und liegt als Textdatei vor. So kann es beispielsweise als SQL Dump bei einer Datenbank oder als LDIF-Datei für einen LDAP-Server vorliegen.
es_es: Para servicios que administren datos (como bases de datos), es muy recomendable exportarlos a un formato estándar que pueda ser importado fácilmente por el nuevo software. Tal formato generalmente está documentado y es texto plano; puede ser, por ejemplo, un volcado SQL para una base de datos o un archivo LDIF para un servidor LDAP.

source: Database backups
de_de: Datenbanksicherungen
es_es: Respaldos de base de datos

source: Each server software is different, and it is impossible to detail all existing cases. See the new and current software documentation to identify the exportable (thus, re-importable) portions and those which will require manual manipulation. Reading this book will clarify the configuration of the main Linux server programs.
de_de: Jede Serversoftware ist unterschiedlich, und es ist unmöglich, auf jedes Detail aller existierenden Fälle einzugehen. Lesen Sie die vorliegende Dokumentation, um herauszufinden, welche Bereiche exportiert (also wieder importiert) werden können und welche Bereiche manuell angepasst werden müssen. Das Ziel dieses Buches ist es, die Konfiguration der gängigen Serverprogramme unter Linux zu veranschaulichen.
es_es: Cada software de servidor es diferente y es imposible detallar todos los casos posibles. Revise la documentación del software nuevo y el actual para identificar las porciones exportables (y, por lo tanto, importables) y aquellas que necesitarán manipulación manual. Leer este libro clarificará la configuración de los principales programas de servidor en Linux.

source: Taking Over an Existing Debian Server
de_de: Übernahme eines vorhandenen Debianservers
es_es: Tomando control de un servidor Debian existente

source: <primary>recovering a Debian machine</primary>
de_de: <primary>Wiederherstellung eines Debian-Rechners</primary>
es_es: <primary>recuperación de un equipo Debian</primary>

source: <primary>exploring a Debian machine</primary>
de_de: <primary>Untersuchen eines Debian-Rechners</primary>
es_es: <primary>explorando un equipo Debian</primary>

source: <primary>taking over a Debian server</primary>
de_de: <primary>Übernahme eines Debian-Servers</primary>
es_es: <primary>tomando el control de un servidor Debian</primary>

source: To effectively take over its maintenance, one may analyze a machine already running with Debian.
de_de: Um die Wartung erfolgreich zu übernehmen, kann man einen bereits mit Debian laufenden Server analysieren.
es_es: Para efectivamente tomar el control de su mantenimiento, uno podría analizar un equipo que ya ejecuta Debian.

source: The first file to check is <filename>/etc/debian_version</filename>, which usually contains the version number for the installed Debian system (it is part of the <emphasis>base-files</emphasis> package). If it indicates <literal><replaceable>codename</replaceable>/sid</literal>, it means that the system was updated with packages coming from one of the development distributions (either testing or unstable).
es_es: El primer archivo a revisar es <filename>/etc/debian_version</filename> que generalmente contiene el número de versión para el sistema Debian instalado (es parte del paquete <emphasis>base-files</emphasis>. Si indica <literal><replaceable>nombre_código</replaceable>/sid</literal> significa que el sistema fue actualizado con paquetes que provienen de alguna de las distribuciones en desarrollo («Testing» o «Unstable»).
