Repository: nuradiyana/debian-handbook
Catalog: */03_existing-setup.po
Languages: de_de, es_es

source: The <command>apt-show-versions</command> program (from the Debian package of the same name) checks the list of packages installed and identifies the versions available. <command>aptitude</command> can also be used for these tasks, albeit in a less systematic manner.
de_de: Das Programm <command>apt-show-versions</command> (aus dem gleichnamigen Debian-Paket) überprüft die Liste der installierten Pakete und identifiziert die verfügbaren Versionen. Für diesen Zweck kann auch <command>aptitude</command> benutzt werden, wenn auch in einer weniger systematischen Art und Weise.
es_es: El programa <command>apt-show-versions</command> (que se encuentra en el paquete Debian que lleva el mismo nombre) comprueba la lista de paquetes instalados e identifica las versiones disponibles. Puede utilizar también <command>aptitude</command> para estas tareas, aunque de un modo menos sistemático.

source: A glance at the <filename>/etc/apt/sources.list</filename> file will show where the installed Debian packages likely came from. If many unknown sources appear, the administrator may choose to completely reinstall the computer's system to ensure optimal compatibility with the software provided by Debian.
de_de: Ein kurzer Blick auf die Datei <filename>/etc/apt/sources.list</filename> zeigt, woher die installierten Debian-Pakete kamen. Falls viele unbekannte Quellen erscheinen, könnte es der Administrator vorziehen, das Betriebssystem komplett neu zu installieren, um die optimale Kompatibilität zu gewährleisten, welche durch die Software von Debian sichergestellt wird.
es_es: Revisar el archivo <filename>/etc/apt/sources.list</filename> mostrará de dónde es probable que provengan los paquetes Debian. Si aparecen muchas fuentes desconocidas, el administrador podría elegir reinstalar el sistema completamente para asegurar compatibilidad óptima con el software provisto por Debian.

source: The <filename>sources.list</filename> file is often a good indicator: the majority of administrators keep, at least in comments, the list of prior APT sources used. But you should not forget that sources used in the past might have been deleted, and that some random packages grabbed on the Internet might have been manually installed (with the <command>dpkg</command> command). In this case, the machine is misleading in its appearance of “standard” Debian. This is why you should pay attention to any indication that will give away the presence of external packages (appearance of <filename>deb</filename> files in unusual directories, package version numbers with a special suffix indicating that it originated from outside the Debian project, such as <literal>ubuntu</literal> or <literal>ximian</literal>, etc.)
de_de: Die Datei <filename>sources.list</filename> ist oft ein guter Indikator: Die Mehrheit der Administratoren lassen Einträge zu früher genutzten APT-Quellen bestehen, oft auch auskommentiert. Dabei ist zu beachten, dass ehemalige Quellen inzwischen gelöscht und auch manuell zufällig aus dem Internet heruntergeladene Pakete installiert worden sein können (mithilfe des Kommandos <command>dpkg</command>). In diesem Fall trügt das Erscheinungsbild eines "Standard"-Debian. Darum sollte man auf jeden noch so kleinen Hinweis achten, der auf die Existenz externer Pakete hindeutet (Vorhandensein von <filename>deb</filename>-Dateien in unüblichen Verzeichnissen, Paketversionsnummern mit spezieller Endung, welche auf eine Herkunft außerhalb des Debian-Projekts hindeuten, so zum Beispiel <literal>ubuntu</literal>, <literal>ximian</literal> etc.).
es_es: El archivo <filename>sources.list</filename> es generalmente un buen indicador: la mayoría de los administradores mantienen, al menos como comentarios, la lista de fuentes APT utilizadas anteriormente. Pero no debe olvidar que fuentes utilizadas previamente podrían haber sido eliminadas y se podrían haber instalado manualmente paquetes al azar descargados de internet (con la orden <command>dpkg</command>). En este caso, la apariencia del equipo como un Debian estándar es engañosa. Es por eso que debe prestar atención a cualquier indicación que revele la presencia de paquetes externos (archivos <filename>deb</filename> en directorios inusuales, números de versión de paquetes con sufijos especiales que indican su origen fuera del proyecto Debian como <literal>ubuntu</literal> o <literal>ximian</literal>, etc.)

source: Likewise, it is interesting to analyze the contents of the directory <filename>/usr/local/</filename>, intended to contain programs compiled and installed manually. Listing software installed in this manner is instructive, since this raises questions on the reasons for not using the corresponding Debian package, if such a package exists.
de_de: Genauso interessant ist es, den Inhalt des Verzeichnisses <filename>/usr/local/</filename> zu analysieren. Dieses Verzeichnis soll Programme beinhalten, die manuell kompiliert und installiert wurden. Eine Auflistung von Software, die auf diese Weise installiert wurde, ist lehrreich, denn es stellt sich die Frage nach den Gründen, warum nicht das entsprechende Debian-Paket benutzt wurde (falls ein solches existiert).
es_es: De la misma forma, es interesante analizar el contenido del directorio <filename>/usr/local/</filename>, cuyo propósito es albergar programas compilados e instalados manualmente. Generar una lista de software instalado de esta forma es instructivo, ya que genera dudas sobre las razones para no utilizar el paquete Debian correspondiente, si es que existe.

source: <emphasis>QUICK LOOK</emphasis> <emphasis role="pkg">cruft</emphasis>
de_de: <emphasis>Schnellansicht</emphasis> <emphasis role="pkg">cruft</emphasis>
es_es: <emphasis>VISTA RÁPIDA</emphasis> <emphasis role="pkg">cruft</emphasis>

source: The <emphasis role="pkg">cruft</emphasis> package proposes to list the available files that are not owned by any package. It has some filters (more or less effective, and more or less up to date) to avoid reporting some legitimate files (files generated by Debian packages, or generated configuration files not managed by <command>dpkg</command>, etc.).
de_de: Das <emphasis role="pkg">cruft</emphasis>-Paket schlägt vor, die verfügbaren Dateien aufzulisten, die nicht zu einem Paket gehören. Es besitzt einige Filter (mehr oder weniger effektiv und mehr oder weniger aktuell), um zu vermeiden, dass legitime Dateien (solche, die von Debian-Paketen generiert werden, oder generierte Konfigurationsdateien, die nicht von <command>dpkg</command> usw. gemanagt werden) aufgeführt werden.
es_es: El paquete <emphasis role="pkg">cruft</emphasis> se propone listar todos los archivos disponibles que no son parte de ningún paquete. Tiene algunos filtros (más o menos efectivos y más o menos actualizados) para evitar reportar archivos legítimos (archivos generados por paquetes Debian o archivos de configuración generados que no son administrados por <command>dpkg</command>, etc.).

source: Be careful to not blindly delete everything that <command>cruft</command> might list!
de_de: Seien Sie vorsichtig und löschen Sie nicht blind alles, was <command>cruft</command> aufführen könnte!
es_es: ¡Tenga cuidado de no borrar ciegamente todo lo que liste <command>cruft</command>!

source: Installing Debian
de_de: Installation von Debian
es_es: Instalando Debian

source: All information on the current server being now known, we can shut it down and begin to install Debian on it.
de_de: Da nun alle Informationen über den bestehenden Server bekannt sind, können wir ihn herunterfahren und dann beginnen, Debian darauf zu installieren.
es_es: Sabiendo ahora toda la información del servidor actual, podemos apagarlo y comenzar a instalar Debian en él.

source: <primary>architecture</primary>
de_de: <primary>Architektur</primary>
es_es: <primary>arquitectura</primary>

source: To choose the appropriate version, we must know the computer's architecture. If it is a PC, it is most likely to be i386. In other cases, we can narrow down the possibilities according to the previously used system.
de_de: Um die passende Version auszuwählen, müssen wir die Systemarchitektur kennen. Wenn es ein PC ist, dann wird dies sehr wahrscheinlich i386 sein. In anderen Fällen können wir die Möglichkeiten entsprechend dem zuvor genutzten System eingrenzen.
es_es: Para elegir la versión apropiada, debemos saber la arquitectura del equipo. Si es una PC, es probable que sea i386. En otros casos podemos reducir las posibilidades según el sistema utilizado previamente.

source: Installing the appropriate Debian version
de_de: Installation der passenden Debian-Version
es_es: Instalando la versión de Debian adecuada

source: <xref linkend="tab-corresp" xrefstyle="select: label nopage" /> is not intended to be exhaustive, but may be helpful. In any case, the original documentation for the computer is the most reliable source to find this information.
de_de: Es ist nicht vorgesehen, dass <xref linkend="tab-corresp" xrefstyle="select: label nopage" /> vollständig ist, aber es kann hilfreich sein. In jedem Fall ist die Originaldokumentation die verlässlichste Quelle, um diese Informationen zu finden.
es_es: La <xref linkend="tab-corresp" xrefstyle="select: label nopage" /> no pretende ser exhaustiva, pero puede ser útil. En cualquier caso, la documentación original para el equipo es la fuente más confiable para encontrar esta información.

source: <emphasis>HARDWARE</emphasis> Next-generation PC
de_de: <emphasis>HARDWARE</emphasis> PC der nächsten Generation
es_es: <emphasis>HARDWARE</emphasis> La próxima generación de PC

source: Most recent computers have 64 bit Intel or AMD processors, compatible with older 32 bit processors; the software compiled for “i386” architecture thus works. On the other hand, this compatibility mode does not fully exploit the capabilities of these new processors. This is why Debian provides software for “ia64” architecture for Intel Itanium chips and “amd64” for AMD chips. This last also works with Intel “em64t” processors, which are very similar to AMD64 processors.
de_de: Die meisten aktuellen Computer besitzen 64-bit-Intel- oder -AMD-Prozessoren, die kompatibel zu älteren 32-bit-Prozessoren sind; daher läuft auf ihnen Software, die für die i386-Architektur übersetzt wurde. Andererseits werden durch diesen Kompatibilitätsmodus die Möglichkeiten dieser neuen Prozessoren nicht vollständig genutzt. Deshalb liefert Debian Software für die ia64-Architektur von Intel-Itanium-Chips und für die amd64-Architektur von AMD-Chips. Letztere funktioniert auch auf Intel-em64t-Prozessoren, die den AMD64 Prozessoren sehr ähnlich sind.
es_es: La mayoría de los equipos recientes tiene procesadores Intel o AMD de 64 bits, compatibles con los procesadores antiguos de 32 bits; por lo tanto funcionará el software compilado para la arquitectura «i386». Por el otro lado, este modo de compatibilidad no aprovecha completamente las capacidades de estos nuevos procesadores. Es por esto que Debian provee software para la arquitectura «ia64» de los chips Itanium de Intel y «amd64» para los chips de AMD. Esta última también funciona con procesadores «em64t» de Intel, que son muy similares a los procesadores AMD64.

source: Matching operating system and architecture
de_de: Passende Betriebssysteme und Architektur
es_es: Emparejando sistema operativo y arquitectura

source: Operating System
de_de: Betriebssystem
es_es: Sistema operativo

source: Architecture(s)
de_de: Architektur(en)
es_es: Arquitectura(s)

source: Installing and Configuring the Selected Services
de_de: Installation und Einrichtung der ausgewählten Dienste
es_es: Instalación y configuración de los servicios seleccionados

source: Once Debian is installed, we must install and configure one by one all of the services that this computer must host. The new configuration must take into consideration the prior one in order to ensure a smooth transition. All the information collected in the first two steps are useful to successfully complete this part.
de_de: Nach der Installation von Debian müssen wir Stück für Stück die Dienste installieren und einrichten, die auf diesem Computer laufen müssen. Die neue Konfiguration muss sich an der vorherigen orientieren, um einen reibungslosen Übergang zu gewährleisten. Alle in den beiden ersten Schritten gesammelten Informationen sind nützlich, um diesen Teil erfolgreich abzuschließen.
es_es: Una vez que Debian está instalado debemos instalar y configurar, uno por uno, todos los servicios que debe tener este equipo. La nueva configuración debe tener en cuenta la anterior para asegurar una transición fluida. Toda la información recolectada en los primeros dos pasos es útil para completar esta parte exitosamente.

source: Install the selected services
de_de: Installation der ausgewählten Dienste
es_es: Instalación de los servicios seleccionados

source: Prior to jumping in to this exercise with both feet, it is strongly recommended that you read the remainder of this book. After that you will have a more precise understanding of how to configure the expected services.
de_de: Bevor man sich Hals über Kopf auf diese Aufgabe stürzt, sollte man unbedingt den Rest dieses Buches lesen. Danach wird man ein genaueres Verständnis davon haben, wie die erwarteten Dienste einzurichten sind.
es_es: Antes de sumergirse completamente en este ejercicio es muy recomendable que lea el resto de este libro. Luego tendrá un entendimiento más preciso de cómo configurar los servicios esperados.
