Repository: nuradiyana/debian-handbook
Catalog: */90_derivative-distributions.po
Languages: pt_br

source: Specificities
pt_br: Especificidades

source: Particular Choices
pt_br: Escolhas Particulares

source: Derivative Distributions
pt_br: Distribuições Derivadas

source: <indexterm><primary>derivative distribution</primary></indexterm> <indexterm><primary>distribution, derivative</primary></indexterm> Many Linux distributions are derivatives of Debian and reuse Debian's package management tools. They all have their own interesting properties, and it is possible one of them will fulfill your needs better than Debian itself.
pt_br: <indexterm><primary>distribuicao derivada</primary></indexterm> <indexterm><primary>distribuicao, derivada</primary></indexterm> Muitas distribuições Linux são derivadas do Debian e as ferramentas de reutilização de gerenciamento de pacotes do Debian. Todos eles têm suas próprias propriedades interessantes, e é possível que uma delas va atender suas necessidades melhor do que o próprio Debian.

source: Census and Cooperation
pt_br: Censo e Cooperação

source: The Debian project fully acknowledges the importance of derivative distributions and actively supports collaboration between all involved parties. This usually involves merging back the improvements initially developed by derivative distributions so that everyone can benefit and long-term maintenance work is reduced.
pt_br: O projeto Debian reconhece plenamente a importância de distribuições derivadas e apoia ativamente a colaboração entre todas partes envolvidas. Isso geralmente envolve a fusão do retorno das melhorias desenvolvidas inicialmente pelas distribuições derivadas para que todos possam beneficiar e a longo prazo, o trabalho de manutenção é reduzido.

source: This explains why derivative distributions are invited to become involved in discussions on the <literal>debian-derivatives@lists.debian.org</literal> mailing-list, and to participate in the derivative census. This census aims at collecting information on work happening in a derivative so that official Debian maintainers can better track the state of their package in Debian variants. <ulink type="block" url="http://wiki.debian.org/DerivativesFrontDesk" /><ulink type="block" url="http://wiki.debian.org/Derivatives/Census" />
pt_br: Isso explica porque distribuições derivadas são convidadas a se envolver em discussões sobre o <literal>debian-derivatives@lists.debian.org</literal> mailing-list, e para participar do censo derivado. Este recenseamento visa recolher informações sobre o trabalho que acontece em um derivado para que os mantenedores do Debian oficiais possam controlar melhor o estado de seu pacote em variantes do Debian. <ulink type="block" url="http://wiki.debian.org/DerivativesFrontDesk"/><ulink type="block" url="http://wiki.debian.org/Derivatives/Census" />

source: Let us now briefly describe the most interesting and popular derivative distributions.
pt_br: Vamos agora descrever brevemente as distribuições mais interessantes e populares derivadas.

source: <indexterm><primary>Ubuntu</primary></indexterm> Ubuntu made quite a splash when it came on the Free Software scene, and for good reason: Canonical Ltd., the company that created this distribution, started by hiring thirty-odd Debian developers and publicly stating the far-reaching objective of providing a distribution for the general public with a new release twice a year. They also committed to maintaining each version for a year and a half for both core and security-related components.
pt_br: <indexterm><primary>Ubuntu</primary></indexterm> Ubuntu espalhou bastante quando entrou em cena do Software Livre, e por boas razões: Canonical Ltd., a empresa que criou esta distribuição, iniciou a contratação de trinta ímpares desenvolvedores Debian e afirmou publicamente o objetivo de longo alcance de proporcionar uma distribuição para o público em geral com uma nova versão duas vezes por ano. Eles também se comprometeram a manutenção de cada versão por um ano e meio tanto para o núcleo e quanto a de segurança relacionados aos componentes.

source: These objectives necessarily involve a reduction in scope; Ubuntu focuses on a smaller number of packages than Debian, and relies primarily on the GNOME desktop (although an official Ubuntu derivative, called “Kubuntu”<indexterm><primary>Kubuntu</primary></indexterm>, relies on KDE). Everything is internationalized and made available in a great many languages.
pt_br: Estes objectivos envolvem necessariamente uma redução do âmbito de aplicação; Ubuntu se concentra em um número menor de pacotes do Debian, e se baseia principalmente na área de trabalho GNOME (apesar de um derivado oficial do Ubuntu, chamada de "Kubuntu" <indexterm><primary>Kubuntu</primary></indexterm>, depender do KDE). Tudo é internacionalizado e disponibilizado em um grande número de línguas.

source: So far, Ubuntu has managed to keep this release rhythm. They also publish <emphasis>Long Term Support</emphasis> (LTS) releases, with a 5-year maintenance promise. As of April 2012, the current LTS version is version 12.04, nicknamed Precise Pangolin. The latest non-LTS version is 11.10, nicknamed Oneiric Ocelot. Version numbers describe the release date: 11.10, for example, was released in October 2011.
pt_br: Até agora, o Ubuntu tem conseguido manter este ritmo de liberação. Eles também publicam lançamento de <emphasis>Suporte Longo Prazo</emphasis> (LTS), com a promessa de manutenção de 5 anos. Em abril de 2012, a versão atual é a versão LTS 12,04, apelidado Precise Pangolin. A última versão não é LTS 11,10, apelidado de Oneiric Ocelot. Os números de versão descrevem a data de lançamento: 11.10, por exemplo, foi lançado em outubro de 2011.

source: Ubuntu has reached a wide audience in the general public. Millions of users were impressed by its ease of installation, and the work that went into making the desktop simpler to use.
pt_br: Ubuntu atingiu uma vasta audiência no público em geral. Milhões de usuários ficaram impressionados com a sua facilidade de instalação, e o trabalho foi fazendo o ambiente de trabalho mais simples de usar.

source: However, not everything is fine and dandy, especially for Debian developers who placed great hopes in Ubuntu contributing directly to Debian. Even though this situation has improved over the years, many have been irked by the Canonical marketing, which implied Ubuntu were good citizens in the Free Software world simply because they made public the changes they applied to Debian packages. Free Software proponents understand that an automatically-generated patch is of little use to the upstream contribution process. Getting one's work integrated requires direct interaction with the other party.
pt_br: No entanto, nem tudo é fino e elegante, especialmente para os desenvolvedores Debian que colocaram grandes esperanças no Ubuntu contribuindo diretamente para o Debian. Mesmo que esta situação tenha melhorado ao longo dos anos, muitos ficaram irritados pelo marketing da Canonical, o que implicou Ubuntu eram bons cidadãos no mundo do Software Livre, simplesmente porque eles fizeram público as mudanças que se candidataram a pacotes Debian. Defensores do Software Livre entendem que um patch gerado automaticamente é de pouca utilidade para o processo de contribuição a montante. Começar um trabalho de integração, exige a interação direta com a outra parte.

source: This interaction is becoming more common over time, thanks in part to the Ubuntu community and the efforts it makes in educating its new contributors. But this policy is still not enforced by Canonical on its employees. Some kept true to their roots, and do make the required effort (Colin Watson, Martin Pitt and Matthias Klose are noteworthy in this regard), but others — often overworked — can no longer find it in them. <ulink type="block" url="http://www.ubuntu.com/" />
pt_br: Essa interação está se tornando mais comum ao longo do tempo, graças em parte à comunidade Ubuntu e aos esforços que faz para educar os seus novos colaboradores. Mas essa política ainda não é reforçada pela Canonical em seus funcionários. Alguns mantiveram fiéis às suas raízes, e não fizeram o esforço necessário (Colin Watson, Martin Pitt e Matthias Klose são notáveis a este respeito), mas outros - muitas vezes com excesso de trabalho - não podem mais encontrá-lo neles. <ulink type="block" url="http://www.ubuntu.com/" />

source: <indexterm><primary><foreignphrase>LiveCD</foreignphrase></primary></indexterm> <indexterm><primary>Knoppix</primary></indexterm> <indexterm><primary>bootable CD-ROM</primary></indexterm> <indexterm><primary>CD-ROM</primary><secondary>bootable</secondary></indexterm> The Knoppix distribution barely needs an introduction. It was the first popular distribution to provide a <emphasis>LiveCD</emphasis>; in other words, a bootable CD-ROM that runs a turn-key Linux system with no requirement for a hard-disk — any system already installed on the machine will be left untouched. Automatic detection of available devices allows this distribution to work in most hardware configurations. The CD-ROM includes almost 2 GB of (compressed) software.
pt_br: <indexterm><primary><foreignphrase>LiveCD</foreignphrase></primary></indexterm><indexterm><primary>Knoppix</primary></indexterm><indexterm><primary>CD-ROM inicializável</primary></indexterm><indexterm><primary>CD-ROM</primary><secondary>inicializável</secondary></indexterm>A distribuição Knoppix mal precisa de uma introdução. Foi a primeira distribuição popular a proporcionar um <emphasis>LiveCD</emphasis>, em outras palavras, um CD-ROM que executa um sistema Linux de transformação de chave sem a necessidade de um disco rígido - qualquer sistema já instalado na máquina será deixado intocado. A detecção automática de dispositivos disponíveis permite que essa distribuição trabalhe na maioria das configurações de hardware. O CD-ROM inclui quase 2 GB de softwares (compactados).

source: Combining this CD-ROM and a USB stick allows carrying your files with you, and to work on any computer without leaving a trace — remember that the distribution doesn't use the hard-disk at all. Knoppix is mostly based on LXDE (a lightweight graphical desktop), but many other distributions provide other combinations of desktops and software. This is, in part, made possible thanks to the <emphasis role="pkg">live-build</emphasis> Debian package that makes it relatively easy to create a LiveCD. <ulink type="block" url="http://live.debian.net/" />
pt_br: Combinando este CD-ROM e um pendrive USB permite carregar seus arquivos com você, e trabalhar em qualquer computador sem deixar rastros - lembre-se que a distribuição não usa o disco rígido em tudo. Knoppix se baseia principalmente em LXDE (um desktop gráfico leve), mas muitas outras distribuições fornecem outras combinações de desktops e software. Isto é, em parte, possível graças ao pacote Debian <emphasis role="pkg">live-build</emphasis> que torna relativamente fácil criar um LiveCD. <ulink type="block" url="http://live.debian.net/" />

source: Note that Knoppix also provides an installer: you can first try the distribution as a LiveCD, then install it on a hard-disk to get better performance. <ulink type="block" url="http://www.knopper.net/knoppix/index-en.html" />
pt_br: Note que o Knoppix também fornece um instalador: você pode tentar primeiro a distribuição como um LiveCD e instalá-lo em um disco rígido para obter um melhor desempenho. <ulink type="block" url="http://www.knopper.net/knoppix/index-en.html" />

source: <indexterm><primary>Linux Mint</primary></indexterm> Linux Mint is a (partly) community-maintained distribution, supported by donations and advertisements. Their flagship product is based on Ubuntu, but they also provide a “Linux Mint Debian Edition” variant that evolves continuously (as it's based on Debian Testing). In both cases, the initial installation involves booting a LiveDVD.
pt_br: <indexterm><primary>Linux Mint</primary></indexterm> Linux Mint é (em parte) mantido pela comunidade de distribuição, apoiada por doações e propagandas. Seu principal produto é baseado no Ubuntu, mas também proporciona uma "Edição Linux Mint Debian" variante que evolui continuamente (como ele é baseado no Debian Testing). Em ambos os casos, a instalação inicial envolve a inicialização de um LiveDVD.

source: The distribution aims at simplifying access to advanced technologies, and provides specific graphical user interfaces on top of the usual software. For instance, even though Linux Mint relies on GNOME, it provides a different menu system; similarly, the package management interface, although based on APT, provides a specific interface with an evaluation of the risk from each package update.
pt_br: A distribuição tem por objectivo simplificar o acesso às tecnologias avançadas, e fornecer específicas interfaces gráficas de usuário no topo do software usual. Por exemplo, embora o Linux Mint conte com o GNOME, ele fornece um sistema de menu diferente, do mesmo modo, a interface de gerenciamento de pacotes, embora baseada em APT, fornece uma interface específica com uma avaliação do risco de cada atualização do pacote.

source: Linux Mint includes a large amount of proprietary software to improve the experience of users who might need those. For example: Adobe Flash and multimedia codecs. <ulink type="block" url="http://www.linuxmint.com/" />
pt_br: Linux Mint inclui uma grande quantidade de softwares proprietários para melhorar a experiência de usuários que podem precisar deles. Por exemplo: Adobe Flash e codecs multimídia. <ulink type="block" url="http://www.linuxmint.com/" />

source: <indexterm><primary>SimplyMEPIS</primary></indexterm> SimplyMEPIS is a commercial distribution very similar to Knoppix. It provides a turn-key Linux system from a LiveCD, and includes a number of non-free software packages: device drivers for nVidia video cards, Flash for animations embedded in many websites, RealPlayer, Sun's Java, and so on. The goal is to provide a 100 % working system out of the box. Mepis is internationalized and handles many languages. <ulink type="block" url="http://www.mepis.org/" />
pt_br: <indexterm><primary>SimplyMEPIS</primary></indexterm> SimplyMEPIS é uma distribuição comercial muito semelhante ao Knoppix. Ele fornece um sistema de chaves Linux a partir de um LiveCD, e inclui uma série de pacotes de software não-livres: drivers das placas de vídeo, nVidia Flash para animações embutidas em muitos sites, RealPlayer, Java da Sun, e assim por diante. O objetivo é proporcionar um sistema de 100% de trabalho para fora da caixa. Mepis é internacionalizado e lida com muitas línguas. <ulink type="block" url="http://www.mepis.org/" />

source: This distribution was originally based on Debian; it went to Ubuntu for a while, then came back to Debian Stable, which allows its developers to focus on adding features without having to stabilize packages coming from Debian's <emphasis role="distribution">Unstable</emphasis> distribution.
pt_br: Esta distribuição foi originalmente baseada no Debian, foi para o Ubuntu por um tempo, depois voltou para a distribuição estável do Debian, que permite que seus desenvolvedores se concentrem em adicionar funcionalidades sem a necessidade de estabilizar os pacotes vindos da distribuição Debian <emphasis role="distribution">Instável</emphasis>.

source: Aptosid (Formerly Sidux)
pt_br: Aptosid (Anteriormente Sidux)

source: <indexterm><primary>Sidux</primary></indexterm> <indexterm><primary>Aptosid</primary></indexterm> This community-based distribution tracks the changes in Debian <emphasis role="distribution">Sid</emphasis> (<emphasis role="distribution">Unstable</emphasis>) — hence its name — and tries to release 4 new versions each year. The modifications are limited in scope: the goal is to provide the most recent software and to update drivers for the most recent hardware, while still allowing users to switch back to the official Debian distribution at any time. <ulink type="block" url="http://aptosid.com" />
pt_br: <indexterm><primary>Sidux</primary></indexterm> <indexterm><primary>Aptosid</primary></indexterm> Esta distribuição baseada na comunidade acompanha as alterações no Debian <emphasis role="distribution">Sid</emphasis> (<emphasis role="distribution">Instável</emphasis>) - daí o seu nome - e tenta lançar 4 novas versões a cada ano. As modificações são limitadas em escopo: o objetivo é fornecer o software mais recente e atualizar os drivers para o hardware mais recente, enquanto ainda permite aos usuários alternar de volta para a distribuição Debian oficial a qualquer momento. <ulink type="block" url="http://aptosid.com" />

source: This distribution provides a tiny LiveCD, weighing only 50 MB, so that it can fit on a CD-ROM with the shape and size of a business card. To achieve this, Damn Small Linux only includes lightweight software tools. This can be interesting to use a Debian-like system on an aging computer. <ulink type="block" url="http://www.damnsmalllinux.org/" />
pt_br: Esta distribuição fornece um minúsculo LiveCD, pesando apenas 50 MB, de modo que possa caber em um CD-ROM com a forma e o tamanho de um cartão de visitas. Para alcançar isso, Damn Small Linux inclui somente ferramentas de software leves. Isto pode ser interessante para utilizar um sistema parecido com o Debian em um computador antigo. <ulink type="block" url="http://www.damnsmalllinux.org/" />

source: And Many More
pt_br: E Muito Mais

source: The Distrowatch website references a huge number of Linux distributions, many of which are based on Debian. Browsing this site is a great way to get a sense of the diversity in the Free Software world. <ulink type="block" url="http://distrowatch.com" />
pt_br: O site Distrowatch referencia um número enorme de distribuições Linux, muitas das quais são baseadas no Debian. Navegar neste site é uma ótima maneira de ter uma noção da diversidade no mundo do Software Livre. <ulink type="block" url="http://distrowatch.com" />

source: The search form can help track down a distribution based on its ancestry. In January 2012, selecting Debian led to 141 active distributions! <ulink type="block" url="http://distrowatch.com/search.php" />
pt_br: O formulário de pesquisa pode ajudar a rastrear uma distribuição baseada em sua ancestralidade. Em janeiro de 2012, Debian levou a 141 distribuições ativas! <ulink type="block" url="http://distrowatch.com/search.php" />
